keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_OFF (21)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_OFF (22)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_OFF (23)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR8 */
#define IFX_VADC_ACCPROT1_APR8_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR8 */
#define IFX_VADC_ACCPROT1_APR8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR8 */
#define IFX_VADC_ACCPROT1_APR8_OFF (24)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR9 */
#define IFX_VADC_ACCPROT1_APR9_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR9 */
#define IFX_VADC_ACCPROT1_APR9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR9 */
#define IFX_VADC_ACCPROT1_APR9_OFF (25)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_OFF (0)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS10 */
#define IFX_VADC_ACCPROT1_APS10_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS10 */
#define IFX_VADC_ACCPROT1_APS10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS10 */
#define IFX_VADC_ACCPROT1_APS10_OFF (10)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_OFF (1)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_OFF (2)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_OFF (3)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_OFF (4)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_OFF (5)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_OFF (6)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_OFF (7)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS8 */
#define IFX_VADC_ACCPROT1_APS8_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS8 */
#define IFX_VADC_ACCPROT1_APS8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS8 */
#define IFX_VADC_ACCPROT1_APS8_OFF (8)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS9 */
#define IFX_VADC_ACCPROT1_APS9_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS9 */
#define IFX_VADC_ACCPROT1_APS9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS9 */
#define IFX_VADC_ACCPROT1_APS9_OFF (9)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_OFF (15)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_OFF (20)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_OFF (16)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_OFF (23)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_OFF (0)

