keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.ICLSEL */
#define IFX_VADC_CHCTR_ICLSEL_OFF (0)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.REFSEL */
#define IFX_VADC_CHCTR_REFSEL_OFF (11)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESPOS */
#define IFX_VADC_CHCTR_RESPOS_OFF (21)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESREG */
#define IFX_VADC_CHCTR_RESREG_OFF (16)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.RESTBS */
#define IFX_VADC_CHCTR_RESTBS_OFF (20)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.SYNC */
#define IFX_VADC_CHCTR_SYNC_OFF (10)

/** \\brief  Length for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CLC_Bits.DISR */
#define IFX_VADC_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CLC_Bits.DISS */
#define IFX_VADC_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_CLC_Bits.EDIS */
#define IFX_VADC_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_LEN (4)

/** \\brief  Mask for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_VADC_EMUXSEL_EMUXGRP0_OFF (0)

/** \\brief  Length for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_LEN (4)

/** \\brief  Mask for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_OFF (8)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_OFF (16)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_OFF (7)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_OFF (30)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_OFF (28)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.CALS */
#define IFX_VADC_G_ARBCFG_CALS_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CALS */
#define IFX_VADC_G_ARBCFG_CALS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CALS */
#define IFX_VADC_G_ARBCFG_CALS_OFF (29)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.CHNR */
#define IFX_VADC_G_ARBCFG_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CHNR */
#define IFX_VADC_G_ARBCFG_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CHNR */
#define IFX_VADC_G_ARBCFG_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_LEN (2)

