keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_OFF (18)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_OFF (31)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_OFF (25)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_OFF (24)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_OFF (25)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_OFF (26)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_OFF (3)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_OFF (7)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_OFF (11)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_OFF (8)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_OFF (20)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_OFF (16)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_OFF (23)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_OFF (28)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_OFF (31)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_OFF (12)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_OFF (13)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_OFF (8)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_LEN (1)

