keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_OFF (15)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_OFF (8)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_OFF (3)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_OFF (2)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_OFF (9)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_OFF (5)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.REQGT */
#define IFX_VADC_G_ASMR_REQGT_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.REQGT */
#define IFX_VADC_G_ASMR_REQGT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.REQGT */
#define IFX_VADC_G_ASMR_REQGT_OFF (7)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.RPTDIS */
#define IFX_VADC_G_ASMR_RPTDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.RPTDIS */
#define IFX_VADC_G_ASMR_RPTDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.RPTDIS */
#define IFX_VADC_G_ASMR_RPTDIS_OFF (16)

/** \\brief  Length for Ifx_VADC_G_ASMR_Bits.SCAN */
#define IFX_VADC_G_ASMR_SCAN_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASMR_Bits.SCAN */
#define IFX_VADC_G_ASMR_SCAN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASMR_Bits.SCAN */
#define IFX_VADC_G_ASMR_SCAN_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_LEN (32)

/** \\brief  Mask for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_LEN (32)

/** \\brief  Mask for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_OFF (8)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_OFF (9)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_OFF (10)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_OFF (11)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_OFF (16)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_OFF (17)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_OFF (18)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFI3 */
#define IFX_VADC_G_BFL_BFI3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFI3 */
#define IFX_VADC_G_BFL_BFI3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFI3 */
#define IFX_VADC_G_BFL_BFI3_OFF (19)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFL0 */
#define IFX_VADC_G_BFL_BFL0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFL0 */
#define IFX_VADC_G_BFL_BFL0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFL0 */
#define IFX_VADC_G_BFL_BFL0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFL1 */
#define IFX_VADC_G_BFL_BFL1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFL1 */
#define IFX_VADC_G_BFL_BFL1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFL1 */
#define IFX_VADC_G_BFL_BFL1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFL2 */
#define IFX_VADC_G_BFL_BFL2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFL2 */
#define IFX_VADC_G_BFL_BFL2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFL2 */
#define IFX_VADC_G_BFL_BFL2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_BFL_Bits.BFL3 */
#define IFX_VADC_G_BFL_BFL3_LEN (1)

