keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_BFL_Bits.BFL3 */
#define IFX_VADC_G_BFL_BFL3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFL_Bits.BFL3 */
#define IFX_VADC_G_BFL_BFL3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_BFLC_Bits.BFM0 */
#define IFX_VADC_G_BFLC_BFM0_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLC_Bits.BFM0 */
#define IFX_VADC_G_BFLC_BFM0_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLC_Bits.BFM0 */
#define IFX_VADC_G_BFLC_BFM0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFLC_Bits.BFM1 */
#define IFX_VADC_G_BFLC_BFM1_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLC_Bits.BFM1 */
#define IFX_VADC_G_BFLC_BFM1_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLC_Bits.BFM1 */
#define IFX_VADC_G_BFLC_BFM1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_BFLC_Bits.BFM2 */
#define IFX_VADC_G_BFLC_BFM2_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLC_Bits.BFM2 */
#define IFX_VADC_G_BFLC_BFM2_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLC_Bits.BFM2 */
#define IFX_VADC_G_BFLC_BFM2_OFF (8)

/** \\brief  Length for Ifx_VADC_G_BFLC_Bits.BFM3 */
#define IFX_VADC_G_BFLC_BFM3_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLC_Bits.BFM3 */
#define IFX_VADC_G_BFLC_BFM3_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLC_Bits.BFM3 */
#define IFX_VADC_G_BFLC_BFM3_OFF (12)

/** \\brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL0NP */
#define IFX_VADC_G_BFLNP_BFL0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL0NP */
#define IFX_VADC_G_BFLNP_BFL0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL0NP */
#define IFX_VADC_G_BFLNP_BFL0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL1NP */
#define IFX_VADC_G_BFLNP_BFL1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL2NP */
#define IFX_VADC_G_BFLNP_BFL2NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_BFLNP_Bits.BFL3NP */
#define IFX_VADC_G_BFLNP_BFL3NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFC0 */
#define IFX_VADC_G_BFLS_BFC0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFC0 */
#define IFX_VADC_G_BFLS_BFC0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFC0 */
#define IFX_VADC_G_BFLS_BFC0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFC1 */
#define IFX_VADC_G_BFLS_BFC1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFC1 */
#define IFX_VADC_G_BFLS_BFC1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFC1 */
#define IFX_VADC_G_BFLS_BFC1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFC2 */
#define IFX_VADC_G_BFLS_BFC2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFC2 */
#define IFX_VADC_G_BFLS_BFC2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFC2 */
#define IFX_VADC_G_BFLS_BFC2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFC3 */
#define IFX_VADC_G_BFLS_BFC3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFC3 */
#define IFX_VADC_G_BFLS_BFC3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFC3 */
#define IFX_VADC_G_BFLS_BFC3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFS0 */
#define IFX_VADC_G_BFLS_BFS0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS0 */
#define IFX_VADC_G_BFLS_BFS0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS0 */
#define IFX_VADC_G_BFLS_BFS0_OFF (16)

/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFS1 */
#define IFX_VADC_G_BFLS_BFS1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS1 */
#define IFX_VADC_G_BFLS_BFS1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS1 */
#define IFX_VADC_G_BFLS_BFS1_OFF (17)

/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFS2 */
#define IFX_VADC_G_BFLS_BFS2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS2 */
#define IFX_VADC_G_BFLS_BFS2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS2 */
#define IFX_VADC_G_BFLS_BFS2_OFF (18)

/** \\brief  Length for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_BFLS_Bits.BFS3 */
#define IFX_VADC_G_BFLS_BFS3_OFF (19)

/** \\brief  Length for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_LEN (12)

/** \\brief  Mask for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_MSK (0xfff)

/** \\brief  Offset for Ifx_VADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_VADC_G_BOUND_BOUNDARY0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_LEN (12)

/** \\brief  Mask for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_MSK (0xfff)

/** \\brief  Offset for Ifx_VADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_VADC_G_BOUND_BOUNDARY1_OFF (16)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV0 */
#define IFX_VADC_G_CEFCLR_CEV0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV1 */
#define IFX_VADC_G_CEFCLR_CEV1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV2 */
#define IFX_VADC_G_CEFCLR_CEV2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV3 */
#define IFX_VADC_G_CEFCLR_CEV3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV4 */
#define IFX_VADC_G_CEFCLR_CEV4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFCLR_Bits.CEV5 */
#define IFX_VADC_G_CEFCLR_CEV5_OFF (5)

