keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH2 */
#define IFX_VADC_G_CHASS_ASSCH2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH30 */
#define IFX_VADC_G_CHASS_ASSCH30_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH30 */
#define IFX_VADC_G_CHASS_ASSCH30_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH30 */
#define IFX_VADC_G_CHASS_ASSCH30_OFF (30)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH31 */
#define IFX_VADC_G_CHASS_ASSCH31_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH31 */
#define IFX_VADC_G_CHASS_ASSCH31_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH31 */
#define IFX_VADC_G_CHASS_ASSCH31_OFF (31)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH3 */
#define IFX_VADC_G_CHASS_ASSCH3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH3 */
#define IFX_VADC_G_CHASS_ASSCH3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH3 */
#define IFX_VADC_G_CHASS_ASSCH3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH4 */
#define IFX_VADC_G_CHASS_ASSCH4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH4 */
#define IFX_VADC_G_CHASS_ASSCH4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH4 */
#define IFX_VADC_G_CHASS_ASSCH4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH5 */
#define IFX_VADC_G_CHASS_ASSCH5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH5 */
#define IFX_VADC_G_CHASS_ASSCH5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH5 */
#define IFX_VADC_G_CHASS_ASSCH5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH6 */
#define IFX_VADC_G_CHASS_ASSCH6_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH6 */
#define IFX_VADC_G_CHASS_ASSCH6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH6 */
#define IFX_VADC_G_CHASS_ASSCH6_OFF (6)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH7 */
#define IFX_VADC_G_CHASS_ASSCH7_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH7 */
#define IFX_VADC_G_CHASS_ASSCH7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH7 */
#define IFX_VADC_G_CHASS_ASSCH7_OFF (7)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH8 */
#define IFX_VADC_G_CHASS_ASSCH8_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH8 */
#define IFX_VADC_G_CHASS_ASSCH8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH8 */
#define IFX_VADC_G_CHASS_ASSCH8_OFF (8)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH9 */
#define IFX_VADC_G_CHASS_ASSCH9_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH9 */
#define IFX_VADC_G_CHASS_ASSCH9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH9 */
#define IFX_VADC_G_CHASS_ASSCH9_OFF (9)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_LEN (3)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_OFF (8)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_LEN (10)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_MSK (0x3ff)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_OFF (16)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_OFF (26)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_LEN (3)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_OFF (0)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_OFF (28)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_OFF (30)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_OFF (29)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_OFF (31)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_OFF (6)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_OFF (7)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_OFF (0)

