keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_OFF (5)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_ENSI_OFF (6)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_EXTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_EXTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_EXTR_OFF (7)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_REQCHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_REQCHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_REQCHNR_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_RF_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_RF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_RF_OFF (5)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_V_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_V_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_V_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QINR0_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QINR0_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QINR0_ENSI_OFF (6)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_EXTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_EXTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_EXTR_OFF (7)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_REQCHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_REQCHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_REQCHNR_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QINR0_RF_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QINR0_RF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QINR0_RF_OFF (5)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_OFF (20)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_OFF (16)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_OFF (23)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_OFF (28)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_OFF (31)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_OFF (12)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_MSK (0x3)

