keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_OFF (13)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_OFF (15)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_OFF (11)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_OFF (2)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_OFF (10)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_OFF (16)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_OFF (9)

/** \\brief  Length for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_OFF (5)

/** \\brief  Length for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_OFF (7)

/** \\brief  Length for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_REFCLR_Bits.REV10 */
#define IFX_VADC_G_REFCLR_REV10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV10 */
#define IFX_VADC_G_REFCLR_REV10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV10 */
#define IFX_VADC_G_REFCLR_REV10_OFF (10)

/** \\brief  Length for Ifx_VADC_G_REFCLR_Bits.REV11 */
#define IFX_VADC_G_REFCLR_REV11_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV11 */
#define IFX_VADC_G_REFCLR_REV11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV11 */
#define IFX_VADC_G_REFCLR_REV11_OFF (11)

/** \\brief  Length for Ifx_VADC_G_REFCLR_Bits.REV12 */
#define IFX_VADC_G_REFCLR_REV12_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV12 */
#define IFX_VADC_G_REFCLR_REV12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV12 */
#define IFX_VADC_G_REFCLR_REV12_OFF (12)

/** \\brief  Length for Ifx_VADC_G_REFCLR_Bits.REV13 */
#define IFX_VADC_G_REFCLR_REV13_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV13 */
#define IFX_VADC_G_REFCLR_REV13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV13 */
#define IFX_VADC_G_REFCLR_REV13_OFF (13)

/** \\brief  Length for Ifx_VADC_G_REFCLR_Bits.REV14 */
#define IFX_VADC_G_REFCLR_REV14_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV14 */
#define IFX_VADC_G_REFCLR_REV14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV14 */
#define IFX_VADC_G_REFCLR_REV14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_REFCLR_Bits.REV15 */
#define IFX_VADC_G_REFCLR_REV15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV15 */
#define IFX_VADC_G_REFCLR_REV15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV15 */
#define IFX_VADC_G_REFCLR_REV15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_REFCLR_Bits.REV1 */
#define IFX_VADC_G_REFCLR_REV1_LEN (1)

