keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_OFF (8)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_OFF (9)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_RRASS_Bits.ASSRR0 */
#define IFX_VADC_G_RRASS_ASSRR0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_RRASS_Bits.ASSRR10 */
#define IFX_VADC_G_RRASS_ASSRR10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_RRASS_Bits.ASSRR10 */
#define IFX_VADC_G_RRASS_ASSRR10_MSK (0x1)

