keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_LEN (2)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_OFF (0)

/** \\brief  Length for Ifx_VADC_RCR_Bits.DMM */
#define IFX_VADC_RCR_DMM_LEN (2)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.DMM */
#define IFX_VADC_RCR_DMM_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.DMM */
#define IFX_VADC_RCR_DMM_OFF (20)

/** \\brief  Length for Ifx_VADC_RCR_Bits.DRCTR */
#define IFX_VADC_RCR_DRCTR_LEN (4)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.DRCTR */
#define IFX_VADC_RCR_DRCTR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.DRCTR */
#define IFX_VADC_RCR_DRCTR_OFF (16)

/** \\brief  Length for Ifx_VADC_RCR_Bits.FEN */
#define IFX_VADC_RCR_FEN_LEN (2)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.FEN */
#define IFX_VADC_RCR_FEN_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.FEN */
#define IFX_VADC_RCR_FEN_OFF (25)

/** \\brief  Length for Ifx_VADC_RCR_Bits.SRGEN */
#define IFX_VADC_RCR_SRGEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.SRGEN */
#define IFX_VADC_RCR_SRGEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.SRGEN */
#define IFX_VADC_RCR_SRGEN_OFF (31)

/** \\brief  Length for Ifx_VADC_RCR_Bits.WFR */
#define IFX_VADC_RCR_WFR_LEN (1)

/** \\brief  Mask for Ifx_VADC_RCR_Bits.WFR */
#define IFX_VADC_RCR_WFR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RCR_Bits.WFR */
#define IFX_VADC_RCR_WFR_OFF (24)

/** \\brief  Length for Ifx_VADC_RES_Bits.CHNR */
#define IFX_VADC_RES_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_RES_Bits.CHNR */
#define IFX_VADC_RES_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_RES_Bits.CHNR */
#define IFX_VADC_RES_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_RES_Bits.CRS */
#define IFX_VADC_RES_CRS_LEN (2)

/** \\brief  Mask for Ifx_VADC_RES_Bits.CRS */
#define IFX_VADC_RES_CRS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_RES_Bits.CRS */
#define IFX_VADC_RES_CRS_OFF (28)

/** \\brief  Length for Ifx_VADC_RES_Bits.DRC */
#define IFX_VADC_RES_DRC_LEN (4)

/** \\brief  Mask for Ifx_VADC_RES_Bits.DRC */
#define IFX_VADC_RES_DRC_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_RES_Bits.DRC */
#define IFX_VADC_RES_DRC_OFF (16)

/** \\brief  Length for Ifx_VADC_RES_Bits.EMUX */
#define IFX_VADC_RES_EMUX_LEN (3)

/** \\brief  Mask for Ifx_VADC_RES_Bits.EMUX */
#define IFX_VADC_RES_EMUX_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_RES_Bits.EMUX */
#define IFX_VADC_RES_EMUX_OFF (25)

/** \\brief  Length for Ifx_VADC_RES_Bits.FCR */
#define IFX_VADC_RES_FCR_LEN (1)

/** \\brief  Mask for Ifx_VADC_RES_Bits.FCR */
#define IFX_VADC_RES_FCR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RES_Bits.FCR */
#define IFX_VADC_RES_FCR_OFF (30)

/** \\brief  Length for Ifx_VADC_RES_Bits.RESULT */
#define IFX_VADC_RES_RESULT_LEN (16)

/** \\brief  Mask for Ifx_VADC_RES_Bits.RESULT */
#define IFX_VADC_RES_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_RES_Bits.RESULT */
#define IFX_VADC_RES_RESULT_OFF (0)

/** \\brief  Length for Ifx_VADC_RES_Bits.VF */
#define IFX_VADC_RES_VF_LEN (1)

/** \\brief  Mask for Ifx_VADC_RES_Bits.VF */
#define IFX_VADC_RES_VF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RES_Bits.VF */
#define IFX_VADC_RES_VF_OFF (31)

/** \\brief  Length for Ifx_VADC_RESD_Bits.CHNR */
#define IFX_VADC_RESD_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.CHNR */
#define IFX_VADC_RESD_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.CHNR */
#define IFX_VADC_RESD_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_RESD_Bits.CRS */
#define IFX_VADC_RESD_CRS_LEN (2)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.CRS */
#define IFX_VADC_RESD_CRS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.CRS */
#define IFX_VADC_RESD_CRS_OFF (28)

/** \\brief  Length for Ifx_VADC_RESD_Bits.DRC */
#define IFX_VADC_RESD_DRC_LEN (4)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.DRC */
#define IFX_VADC_RESD_DRC_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.DRC */
#define IFX_VADC_RESD_DRC_OFF (16)

/** \\brief  Length for Ifx_VADC_RESD_Bits.EMUX */
#define IFX_VADC_RESD_EMUX_LEN (3)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.EMUX */
#define IFX_VADC_RESD_EMUX_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.EMUX */
#define IFX_VADC_RESD_EMUX_OFF (25)

/** \\brief  Length for Ifx_VADC_RESD_Bits.FCR */
#define IFX_VADC_RESD_FCR_LEN (1)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.FCR */
#define IFX_VADC_RESD_FCR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.FCR */
#define IFX_VADC_RESD_FCR_OFF (30)

/** \\brief  Length for Ifx_VADC_RESD_Bits.RESULT */
#define IFX_VADC_RESD_RESULT_LEN (16)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.RESULT */
#define IFX_VADC_RESD_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.RESULT */
#define IFX_VADC_RESD_RESULT_OFF (0)

/** \\brief  Length for Ifx_VADC_RESD_Bits.VF */
#define IFX_VADC_RESD_VF_LEN (1)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.VF */
#define IFX_VADC_RESD_VF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.VF */
#define IFX_VADC_RESD_VF_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_OFF (2)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_OFF (3)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_LEN (3)

