keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_OFF (4)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_OFF (7)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_LEN (6)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_MSK (0x3f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_LEN (6)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_MSK (0x3f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_OFF (24)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_LEN (7)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_MSK (0x7f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MOD_REV */
#define IFX_VADC_SHS_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MOD_REV */
#define IFX_VADC_SHS_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MOD_REV */
#define IFX_VADC_SHS_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MOD_TYPE */
#define IFX_VADC_SHS_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MOD_TYPE */
#define IFX_VADC_SHS_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MOD_TYPE */
#define IFX_VADC_SHS_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_OFF (12)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_OFF (14)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_LEN (2)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_OFF (10)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS_SHSCFG_SP0_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS_SHSCFG_SP0_MSK (0x1)

