keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN5 */
#define IFX_VADC_SHS_STEPCFG_SEN5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN5 */
#define IFX_VADC_SHS_STEPCFG_SEN5_OFF (23)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS_STEPCFG_SEN6_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS_STEPCFG_SEN6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN6 */
#define IFX_VADC_SHS_STEPCFG_SEN6_OFF (27)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS_STEPCFG_SEN7_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS_STEPCFG_SEN7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.SEN7 */
#define IFX_VADC_SHS_STEPCFG_SEN7_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_TIMCFG_Bits.AT */
#define IFX_VADC_SHS_TIMCFG_AT_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_TIMCFG_Bits.AT */
#define IFX_VADC_SHS_TIMCFG_AT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_TIMCFG_Bits.AT */
#define IFX_VADC_SHS_TIMCFG_AT_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_TIMCFG_Bits.FCRT */
#define IFX_VADC_SHS_TIMCFG_FCRT_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_TIMCFG_Bits.FCRT */
#define IFX_VADC_SHS_TIMCFG_FCRT_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_TIMCFG_Bits.FCRT */
#define IFX_VADC_SHS_TIMCFG_FCRT_OFF (4)

/** \\brief  Length for Ifx_VADC_SHS_TIMCFG_Bits.SST */
#define IFX_VADC_SHS_TIMCFG_SST_LEN (6)

/** \\brief  Mask for Ifx_VADC_SHS_TIMCFG_Bits.SST */
#define IFX_VADC_SHS_TIMCFG_SST_MSK (0x3f)

/** \\brief  Offset for Ifx_VADC_SHS_TIMCFG_Bits.SST */
#define IFX_VADC_SHS_TIMCFG_SST_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_TIMCFG_Bits.TGEN */
#define IFX_VADC_SHS_TIMCFG_TGEN_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_TIMCFG_Bits.TGEN */
#define IFX_VADC_SHS_TIMCFG_TGEN_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_TIMCFG_Bits.TGEN */
#define IFX_VADC_SHS_TIMCFG_TGEN_OFF (16)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXVADC_BF_H */
